rsimulator-cxf-rt-transport/src/test/resources/helloWorld/Example_Request.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:sayHi xmlns:ns2="http://transport.cxf.rsimulator.bjuvensjo.github.com/">
            <arg0>(.*)</arg0>
        </ns2:sayHi>
    </soap:Body>
</soap:Envelope>